index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-16 Thu 16:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nathan Mull</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="globalStyle.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Nathan Mull</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Office</td>
<td class="org-left">CDS 907</td>
</tr>

<tr>
<td class="org-left">Email</td>
<td class="org-left">(++ @bu.edu) nmmull</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left"><a href="https://github.com/nmmull">nmmull</a></td>
</tr>
</tbody>
</table>
<p>
I'm a lecturer in the <a href="https://www.bu.edu/cs/">Department of Computer Science</a> at <a href="https://www.bu.edu">Boston
University</a>. Outside of teaching, I'm interested generally in logic and
computing. I've spent some time thinking about <a href="https://en.wikipedia.org/wiki/Proof_complexity#SAT_solvers">proof complexity and
SAT-solvers</a>, and <a href="https://en.wikipedia.org/wiki/Pure_type_system">pure type systems and normalization</a>. Check my <a href="pdfs/CV.pdf">CV</a> for
more information.
</p>
<div id="outline-container-org5ba661a" class="outline-2">
<h2 id="org5ba661a">Teaching</h2>
<div class="outline-text-2" id="text-org5ba661a">
</div>
<ul class="org-ul">
<li><a id="orgb69cf79"></a><b>CAS CS 320</b> Concepts of Programming Languages <a href="https://nmmull.github.io/CS320/landing/Spring-2024/index.html">Spring 2024</a><br /></li>
<li><a id="org6b34625"></a><b>CAS CS 400</b> Type Theory and Mechanized Reasoning <a href="https://nmmull.github.io/CS491-S24/index.html">Spring 2024</a><br /></li>
<li><a id="org8c93bb0"></a><b>CAS CS 132</b> Geometric Algorithms <a href="CS132-F23/index.html">Fall 2023</a><br /></li>
</ul>
</div>
<div id="outline-container-org83face1" class="outline-2">
<h2 id="org83face1">Links</h2>
<div class="outline-text-2" id="text-org83face1">
</div>
<ul class="org-ul">
<li><a id="org5101eda"></a><a href="pages/summer-2024.html">Summer Log (2024)</a><br /></li>
<li><a id="org0e09cf3"></a><a href="pages/policies.html">Course Policies</a><br /></li>
<li><a id="org32eaae6"></a><a href="pages/final-review-320.html">CAS CS 320 Final Review</a><br /></li>
<li><a id="orgbc78280"></a>Projects I like:<br />
<ul class="org-ul">
<li><a id="orgfbc8726"></a><a href="https://dldc.lib.uchicago.edu/open/attachment-converter/index.html">Attachment Converter</a><br /></li>
<li><a id="orge45f062"></a><a href="https://elucidations.vercel.app">Elucidations</a><br /></li>
<li><a id="org326e968"></a><a href="https://builds.openlogicproject.org">Open Logic Project</a><br /></li>
<li><a id="orgda96b61"></a><a href="https://www.picturemecoding.com">Picture Me Coding</a><br /></li>
<li><a id="orgcb3cdd8"></a><a href="https://www.classes.cs.uchicago.edu/archive/2023/winter/22300-1/qh.pdf">A Quarter of Haskell</a><br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org2ba1273" class="outline-2">
<h2 id="org2ba1273">Log</h2>
<div class="outline-text-2" id="text-org2ba1273">
</div>
<ul class="org-ul">
<li><a id="orgf7cda60"></a><b>2023-09-11</b><br />
<div class="outline-text-3" id="text-orgf7cda60">
<p>
The application period is now over but feel free to send me a message
if you're interested in the project.
</p>
</div>
</li>
<li><a id="orgdbc5db1"></a><b>2023-08-24</b><br />
<div class="outline-text-3" id="text-orgdbc5db1">
<p>
I'm acting as a supervisor for a <a href="https://cra.org/ur2phd/">UR2PhD</a> project on
<a href="https://www.bu.edu/urop/opportunity/computer-science-3/">correct-by-construction code design</a>. <del>Apply if you're interested!</del>
</p>
</div>
</li>
</ul>
</div>
</div>
</body>
</html>
